InformationRegisters/ЛБ_СоглашенияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СоглашенияЭДО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСоглашенийЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИзменениеКонтактныхДанныхКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИзменениеКонтактныхДанныхКлиента</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыИзмененийКонтактныхДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдресПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдресПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СогласияНаОбработкуПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаОбработкуПД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСоглашенийПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыСоглашенийЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыСоглашенийЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнуто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛБ_СоглашенияЭДОСервер/Ext/Module.bsl
Функция ЗаключитьЭДОСервер(Клиент, Период) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = Период;
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.ДатаОкончания = ДобавитьМесяц(МенеджерЗаписи.Период, 60);
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено;
		МенеджерЗаписи.Основание     = "Заключено ЭДО";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции // ЗаключитьЭДОСервер()

Функция НаличиеДействующегоСоглашения(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус;
		Если Статус = Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции 

Функция НаличиеСоглашения(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Статус КАК Статус,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ошибочное КАК Ошибочное
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И Статус = &Статус) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Не Выборка.Ошибочное Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция НаличиеРасторжения(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И Статус = &Статус) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Расторгнуто);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Не Выборка.Ошибочное Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция РасторгнутьЭДОСервер(Клиент) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийЭДО.Расторгнуто;
		МенеджерЗаписи.Основание     = "Расторгнуто ЭДО (инициатива клиента)";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции // РасторгнутьЭДОСервер()

Процедура РасторгнутьЭДО_ЦОСервер(Клиент) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийЭДО.Расторгнуто;
		МенеджерЗаписи.Основание     = "Расторгнуто ЭДО (инициатива компании)";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	//Возврат РезультатЗаключения;
КонецПроцедуры // РасторгнутьЭДОСервер()

Процедура УдалитьЗаключениеЭДОСервер(Клиент, СтруктураЭДО) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(СтруктураЭДО.Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийЭДО.НеЗаключено;
		МенеджерЗаписи.Основание     = "Удалено заключение ЭДО";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	//Возврат РезультатЗаключения;
КонецПроцедуры // РасторгнутьЭДОСервер()

Процедура УдалитьРасторжениеЭДОСервер(Клиент, СтруктураЭДО) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(СтруктураЭДО.Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;	
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СоглашенияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено;
		МенеджерЗаписи.Основание     = "Удалено расторжение ЭДО";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	//Возврат РезультатЗаключения;
КонецПроцедуры // РасторгнутьЭДОСервер()

Функция ПоследнийСтатусЭДО(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Статус КАК Статус,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Период КАК Период,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВыборки = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураВыборки.Вставить("Статус",        Выборка.Статус);
		СтруктураВыборки.Вставить("Период",        Выборка.Период);
		СтруктураВыборки.Вставить("Ответственный", Выборка.Ответственный);
	КонецЕсли;
	Возврат СтруктураВыборки;

КонецФункции

Процедура ЗаписатьИзмененияКонтактныхДанных(Клиент, КонтактныеДанные, ПредыдущиеКонтактныеДанные) Экспорт
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период                           = КонтактныеДанные.Период;
		МенеджерЗаписи.Клиент                           = Клиент;
		МенеджерЗаписи.Ломбард                          = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Если КонтактныеДанные.Свойство("Телефон") Тогда
		МенеджерЗаписи.Телефон                          = КонтактныеДанные.Телефон;
		МенеджерЗаписи.ТелефонПредыдущий                = ПредыдущиеКонтактныеДанные.Телефон;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ТелефонДополнительный") Тогда
		МенеджерЗаписи.ТелефонДополнительный            = КонтактныеДанные.ТелефонДополнительный;
		МенеджерЗаписи.ТелефонДополнительныйПредыдущий  = ПредыдущиеКонтактныеДанные.ТелефонДополнительный;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("Email") Тогда
		МенеджерЗаписи.Email                            = КонтактныеДанные.Email;
		МенеджерЗаписи.EmailПредыдущий                  = ПредыдущиеКонтактныеДанные.Email;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("КонтактноеЛицо") Тогда
		МенеджерЗаписи.КонтактноеЛицо                   = КонтактныеДанные.КонтактноеЛицо;
		МенеджерЗаписи.КонтактноеЛицоПредыдущий         = ПредыдущиеКонтактныеДанные.КонтактноеЛицо;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ТелефонКонтактногоЛица") Тогда
		МенеджерЗаписи.ТелефонКонтактногоЛица           = КонтактныеДанные.ТелефонКонтактногоЛица;
		МенеджерЗаписи.ТелефонКонтактногоЛицаПредыдущий = ПредыдущиеКонтактныеДанные.ТелефонКонтактногоЛица;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ФактическийАдрес") Тогда
		МенеджерЗаписи.ФактическийАдрес                 = КонтактныеДанные.ФактическийАдрес;
		МенеджерЗаписи.ФактическийАдресПредыдущий       = ПредыдущиеКонтактныеДанные.ФактическийАдрес;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ПочтовыйАдрес") Тогда
		МенеджерЗаписи.ПочтовыйАдрес                    = КонтактныеДанные.ПочтовыйАдрес;
		МенеджерЗаписи.ПочтовыйАдресПредыдущий          = ПредыдущиеКонтактныеДанные.ПочтовыйАдрес;
		КонецЕсли;
		МенеджерЗаписи.Ответственный                    = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус                           = Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены;
		МенеджерЗаписи.Основание                        = "Подписано заявление об изменении контактных данных";
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПроверкаРоли_ЛБ_СотрудникЦО() Экспорт 
	//Если Пользователи.РолиДоступны("ЛБ_СотрудникЦО") Тогда 
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	Если Не ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ТекущийСотрудникСеанса() Экспорт 
	Возврат ПараметрыСеанса.ТекущийСотрудник;
КонецФункции

#Область ДанныеДляПечати

Функция ПолучитьДанныеДляПечатиСоглашенияЭДО(Клиент, ИзФормыПечати = Ложь) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Период КАК Период,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И Основание = ""Заключено ЭДО"") КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ломбард       = Выборка.Ломбард;
		Ответственный = Выборка.Ответственный;
	КонецЕсли;
	
	Иначе
		ДатаСреза     = ТекущаяДата();
		Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		КонецЕсли;
	КонецЕсли;	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("ДатаЗаключения",                ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного), 
	                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		Если ФИООтветственного.Количество() > 2 Тогда 
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
		Иначе
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 3) + ".";
		КонецЕсли;
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФамилияИнициалыОтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиРасторженияЭДО(Клиент, ИзФормыПечати = Ложь) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Период КАК Период,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Расторгнуто);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ответственный = Выборка.Ответственный;	
	КонецЕсли;	
	
	Иначе
		ДатаСреза     = ТекущаяДата();
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	ЗапросДатаЗаключения = Новый Запрос;
	ЗапросДатаЗаключения.Текст = "ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДОСрезПоследних.Период КАК Период,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус) КАК ЛБ_СоглашенияЭДОСрезПоследних";
	ЗапросДатаЗаключения.УстановитьПараметр("Клиент", Клиент);
	ЗапросДатаЗаключения.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено);
	ЗапросДатаЗаключения.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = ЗапросДатаЗаключения.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		ДатаЗаключения = Выборка.Период;
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	Структура.Вставить("ДатаЗаключения",                ?(ЗначениеЗаполнено(ДатаЗаключения), Формат(ДатаЗаключения, "ДЛФ=D"), ""));
	
	Структура.Вставить("Дата",                          ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));	
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);

	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	Структура.Вставить("ФИООтветственного",             ФамилияОтветственного + " " + ИнициалыОтветственного);
	
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиИзменениеКонтактныхДанных(Клиент, Период, ИзФормыПечати = Ложь, СтруктураРеквизитовКонтактныеДанныеДляПечати = Неопределено) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Период КАК Период,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Телефон КАК Телефон,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ТелефонДополнительный КАК ТелефонДополнительный,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Email КАК Email,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ФактическийАдрес КАК ФактическийАдрес,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ПочтовыйАдрес КАК ПочтовыйАдрес
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента КАК ЛБ_ИзменениеКонтактныхДанныхКлиента
		|ГДЕ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Статус = &Статус
		|	И ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент = &Клиент
		|	И ЛБ_ИзменениеКонтактныхДанныхКлиента.Период = &Период
		|	И НЕ ЛБ_ИзменениеКонтактныхДанныхКлиента.Ошибочное";
		
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДатаСреза = Выборка.Период;
			СтруктураРеквизитовКонтактныеДанныеДляПечати = Новый Структура;
			Если ЗначениеЗаполнено(Выборка.Телефон) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Телефон", Выборка.Телефон);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ТелефонДополнительный) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонДополнительный", Выборка.ТелефонДополнительный);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.Email) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Email", Выборка.Email);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.КонтактноеЛицо) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("КонтактноеЛицо", Выборка.КонтактноеЛицо);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ТелефонКонтактногоЛица) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонКонтактногоЛица", Выборка.ТелефонКонтактногоЛица);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ФактическийАдрес) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ПочтовыйАдрес", Выборка.ПочтовыйАдрес);
			КонецЕсли;
		КонецЕсли;	
		
	Иначе
		ДатаСреза     = ТекущаяДата();
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	Структура.Вставить("Дата",                          ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	СведенияОбОрганизации.НаименованиеДляПечати, ""));
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);													
	//Структура.Вставить("Клиент",                        ?(ЗначениеЗаполнено(Клиент), Строка(Клиент), ""));
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("Телефон",				        ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("Телефон"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.Телефон, Символы.НПП));
	Структура.Вставить("ТелефонДополнительный",			?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ТелефонДополнительный"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.ТелефонДополнительный, Символы.НПП));
	Структура.Вставить("Email",				            ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("Email"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.Email, Символы.НПП));
	Структура.Вставить("КонтактноеЛицо",				?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("КонтактноеЛицо"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.КонтактноеЛицо, Символы.НПП));
	Структура.Вставить("ТелефонКонтактногоЛица",		?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ТелефонКонтактногоЛица"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.ТелефонКонтактногоЛица, Символы.НПП));
	Структура.Вставить("ФактическийАдрес",				?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ФактическийАдрес"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.ФактическийАдрес, Символы.НПП));
	Структура.Вставить("ПочтовыйАдрес",				    ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ПочтовыйАдрес"), 
	СтруктураРеквизитовКонтактныеДанныеДляПечати.ПочтовыйАдрес, Символы.НПП));
	Возврат Структура;
КонецФункции 

Функция ПроверитьНаличиеПредыдущихДанных(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Период КАК Период,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Телефон КАК Телефон,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Email КАК Email,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Клиент КАК Клиент
			|ПОМЕСТИТЬ ПоследниеДанные
			|ИЗ
			|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(
			|			&ТекущаяДата,
			|			Клиент = &Клиент
			|				И Статус = &Статус) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЛБ_ИзменениеКонтактныхДанныхКлиента.Период) КАК Период,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент КАК Клиент
			|ПОМЕСТИТЬ ПредпоследниеДанные_Период
			|ИЗ
			|	ПоследниеДанные КАК ПоследниеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента КАК ЛБ_ИзменениеКонтактныхДанныхКлиента
			|		ПО ПоследниеДанные.Клиент = ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент
			|			И ПоследниеДанные.Период > ЛБ_ИзменениеКонтактныхДанныхКлиента.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Период КАК Период,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Телефон КАК Телефон,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ТелефонДополнительный КАК ТелефонДополнительный,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Email КАК Email,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.КонтактноеЛицо КАК КонтактноеЛицо,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ФактическийАдрес КАК ФактическийАдрес,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.ПочтовыйАдрес КАК ПочтовыйАдрес,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент КАК Клиент,
			|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Ошибочное КАК Ошибочное
			|ИЗ
			|	ПредпоследниеДанные_Период КАК ПредпоследниеДанные_Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента КАК ЛБ_ИзменениеКонтактныхДанныхКлиента
			|		ПО (ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент = ПредпоследниеДанные_Период.Клиент)
			|			И (ЛБ_ИзменениеКонтактныхДанныхКлиента.Период = ПредпоследниеДанные_Период.Период)
			|ГДЕ
			|	НЕ ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент ЕСТЬ NULL
			|	И ЛБ_ИзменениеКонтактныхДанныхКлиента.Статус = &Статус";
		
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Выборка.Ошибочное Тогда
				Возврат "Ошибочное";
			Иначе	
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	
КонецФункции

Функция ПаспортныеДанныеКлиента(Залогодатель, Дата, ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА """"
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
		|	КОНЕЦ КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
		|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
		|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)), Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1,",              Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(" выдан: %1,",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(" дата выдачи: %1,",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(" код подразделения: %1,", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДолжностьОтветственного(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция КонтактнаяИнформацияКлиента(Залогодатель, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          Выборка.Телефон);
        Структура.Вставить("Email",            Выборка.Email);
        Структура.Вставить("АдресПоПрописке",  Выборка.АдресПоПрописке);
        Структура.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          "");
        Структура.Вставить("Email",            "");
        Структура.Вставить("АдресПоПрописке",  "");
        Структура.Вставить("ФактическийАдрес", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция ДанныеКлиента(Залогодатель, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      Выборка.Фамилия);
        Структура.Вставить("Имя",          Выборка.Имя);
        Структура.Вставить("Отчество",     Выборка.Отчество);
        Структура.Вставить("ДатаРождения", Выборка.ДатаРождения);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      "");
        Структура.Вставить("Имя",          "");
        Структура.Вставить("Отчество",     "");
        Структура.Вставить("ДатаРождения", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция ПолучитьМакетСервер(ИмяМакета)
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции // ПолучитьМакетСервер(ИмяМакета)()

Функция ФормированиеДоговораПоШаблону(ИмяМакета) Экспорт
	
	АктивныйДокумент = ПолучитьМакетСервер(ИмяМакета);
	
	УИД = Новый УникальныйИдентификатор();
	Адрес = ПоместитьВоВременноеХранилище(АктивныйДокумент, УИД);
	
	Возврат Адрес;
		
КонецФункции

Функция ПечатьОтчетОбЭДОСервер(ПараметрыОтчетаОбЭДО) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетОбЭДО";
	
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	
	Макет = ПолучитьОбщийМакет("ЛБ_ОтчетОбЭДОИИзмененииКонтактныхДанных");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("ОбластьТаблица");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Организация = ПараметрыОтчетаОбЭДО.Организация.НаименованиеСокращенное;
	ОбластьШапка.Параметры.Ломбард = ПараметрыОтчетаОбЭДО.Ломбард;
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчетаОбЭДО.Ломбард.ПолучитьОбъект(),,ПараметрыОтчетаОбЭДО.НачалоПериода);
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчетаОбЭДО.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	
	Если ПараметрыОтчетаОбЭДО.НачалоПериода = ПараметрыОтчетаОбЭДО.КонецПериода Тогда
		ВыводЗаПериод = Ложь;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчетаОбЭДО.НачалоПериода, "ДЛФ=DD");
	Иначе
		ВыводЗаПериод = Истина;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчетаОбЭДО.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчетаОбЭДО.КонецПериода, "ДЛФ=DD");
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоглашенияЭДО.Клиент КАК Клиент,
		|	ЛБ_СоглашенияЭДО.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_СоглашенияЭДО.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЛБ_СоглашенияЭДО.Статус = &Заключено
		|			ТОГДА ""Соглашение ЭДО""
		|		ИНАЧЕ ""Расторжение ЭДО""
		|	КОНЕЦ КАК Вид,
		|	ЛБ_СоглашенияЭДО.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТСоглашенияОбЭДО
		|ИЗ
		|	РегистрСведений.ЛБ_СоглашенияЭДО КАК ЛБ_СоглашенияЭДО
		|ГДЕ
		|	ЛБ_СоглашенияЭДО.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_СоглашенияЭДО.Ломбард = &Ломбард
		|	И ЛБ_СоглашенияЭДО.Основание <> ""Удалено заключение ЭДО""
		|	И ЛБ_СоглашенияЭДО.Основание <> ""Удалено расторжение ЭДО""
		|	И НЕ ЛБ_СоглашенияЭДО.Ошибочное
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент КАК Клиент,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Период КАК Период,
		|	""Контактные данные"" КАК Вид,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТИзменениеКонтактныхДанных
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента КАК ЛБ_ИзменениеКонтактныхДанныхКлиента
		|ГДЕ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_ИзменениеКонтактныхДанныхКлиента.Ломбард = &Ломбард
		|	И ЛБ_ИзменениеКонтактныхДанныхКлиента.Статус <> &Статус
		|	И НЕ ЛБ_ИзменениеКонтактныхДанныхКлиента.Ошибочное
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПД.Клиент КАК Клиент,
		|	ЛБ_СогласияНаОбработкуПД.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_СогласияНаОбработкуПД.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЛБ_СогласияНаОбработкуПД.Статус = &ПолученоПД
		|			ТОГДА ""Согласие на обработку ПДн""
		|		ИНАЧЕ ""Отзыв Согласия на обработку ПДн""
		|	КОНЕЦ КАК Вид,
		|	ЛБ_СогласияНаОбработкуПД.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТСогласияПД
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД КАК ЛБ_СогласияНаОбработкуПД
		|ГДЕ
		|	ЛБ_СогласияНаОбработкуПД.Ломбард = &Ломбард
		|	И ЛБ_СогласияНаОбработкуПД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ЛБ_СогласияНаОбработкуПД.Ошибочное
		|	И ЛБ_СогласияНаОбработкуПД.Основание <> ""Удалено полученное согласие на обработку ПДн""
		|   И ЛБ_СогласияНаОбработкуПД.Основание <> ""Отозвано согласие на обработку персональных данных (ЦО)""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСоглашенияОбЭДО.Клиент КАК Клиент,
		|	ВТСоглашенияОбЭДО.КлиентДатаРождения КАК ДатаРождения,
		|	ВТСоглашенияОбЭДО.Период КАК Период,
		|	ВТСоглашенияОбЭДО.Вид КАК Вид,
		|	ВТСоглашенияОбЭДО.Ответственный КАК Ответственный
		|ИЗ
		|	ВТСоглашенияОбЭДО КАК ВТСоглашенияОбЭДО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТИзменениеКонтактныхДанных.Клиент,
		|	ВТИзменениеКонтактныхДанных.КлиентДатаРождения,
		|	ВТИзменениеКонтактныхДанных.Период,
		|	ВТИзменениеКонтактныхДанных.Вид,
		|	ВТИзменениеКонтактныхДанных.Ответственный
		|ИЗ
		|	ВТИзменениеКонтактныхДанных КАК ВТИзменениеКонтактныхДанных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСогласияПД.Клиент,
		|	ВТСогласияПД.КлиентДатаРождения,
		|	ВТСогласияПД.Период,
		|	ВТСогласияПД.Вид,
		|	ВТСогласияПД.Ответственный
		|ИЗ
		|	ВТСогласияПД КАК ВТСогласияПД
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Заключено", Перечисления.ЛБ_СтатусыСоглашенийЭДО.Заключено);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.ОтменаИзменения);
	Запрос.УстановитьПараметр("ПолученоПД", Перечисления.ЛБ_СтатусыСоглашенийПД.Получено);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыОтчетаОбЭДО.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчетаОбЭДО.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчетаОбЭДО.Ломбард);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	н = 1;
	Соглашения = 0;
	Расторжения = 0;
	Изменения = 0;
	СогласияПД = 0;
	ОтзывыСогласийПД = 0;
	Пока Выборка.Следующий() Цикл
		ОбластьТаблица.Параметры.Заполнить(Выборка);
		
		ФИООтветственного          = СтрРазделить(Строка(Выборка.Ответственный), " ");
		
		Если ФИООтветственного.Количество() > 0 Тогда
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
		Иначе
			ФамилияОтветственного  = ""; 
			ИнициалыОтветственного = "";
		КонецЕсли;
		
		ОбластьТаблица.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
		
		ДанныеКлиента = ДанныеКлиента(Выборка.Клиент, Выборка.Период);
		ОбластьТаблица.Параметры.Клиент = ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество;
		ОбластьТаблица.Параметры.ДатаРождения = Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьТаблица.Параметры.Номер = н;
		н = н +1;
		Если Выборка.Вид = "Соглашение ЭДО" Тогда
			Соглашения = Соглашения + 1;
		ИначеЕсли Выборка.Вид = "Расторжение ЭДО" Тогда
			Расторжения = Расторжения + 1;
		ИначеЕсли Выборка.Вид = "Контактные данные" Тогда
			Изменения = Изменения + 1;
		ИначеЕсли Выборка.Вид = "Согласие на обработку ПДн" Тогда
			СогласияПД = СогласияПД + 1;
		ИначеЕсли Выборка.Вид = "Отзыв Согласия на обработку ПДн" Тогда
			ОтзывыСогласийПД = ОтзывыСогласийПД + 1;	
		КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТаблица);	
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Соглашения         = Соглашения;
	ОбластьПодвал.Параметры.Расторжения        = Расторжения;
	ОбластьПодвал.Параметры.КонтактныеДанные   = Изменения;
	ОбластьПодвал.Параметры.СогласияПД         = СогласияПД;
	ОбластьПодвал.Параметры.ОтзывыСогласийПД   = ОтзывыСогласийПД;
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;
	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли; 
	
	ДолжностьОтветственного = ДолжностьОтветственного(Ответственный, ТекущаяДата());
	
	ОбластьПодвал.Параметры.ДолжностьОтветственного = ДолжностьОтветственного;
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	Если ВыводЗаПериод Тогда
	    ДанныеНачальника_Управляющего = ПолучитьНачальникаОтделения_Управляющего(ПараметрыОтчетаОбЭДО.Ломбард, ТекущаяДата());
		ОбластьПодвал.Параметры.НачальникОтделения = ?(ДанныеНачальника_Управляющего.Свойство("Должность"), Строка(ДанныеНачальника_Управляющего.Должность), "") 
		+ "______________________" + "(" + ?(ДанныеНачальника_Управляющего.Свойство("Сотрудник"), Строка(ДанныеНачальника_Управляющего.Сотрудник), "") + ")";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьНачальникаОтделения_Управляющего(Ломбард, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ПОМЕСТИТЬ ВТОтделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ПОМЕСТИТЬ ЛомбардыОтделения
		|ИЗ
		|	ВТОтделение КАК ВТОтделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|		ПО ВТОтделение.Отделение = ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда
		|			ТОГДА ""Управляющий ломбарда""
		|	КОНЕЦ КАК Должность
		|ИЗ
		|	ЛомбардыОтделения КАК ЛомбардыОтделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|		ПО ЛомбардыОтделения.Ломбард = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение
		|ГДЕ
		|	(ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытияУвольнение";
	
	Запрос.УстановитьПараметр("ВидСобытияУвольнение", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврата = Новый Структура;
	Если Выборка.Следующий() Тогда	
		Заместитель = ПроверкаЗаместителя(Выборка.Сотрудник, Дата);
		Если ЗначениеЗаполнено(Заместитель) Тогда
			СтруктураВозврата.Вставить("Сотрудник", Заместитель);
		Иначе
			СтруктураВозврата.Вставить("Сотрудник", Выборка.Сотрудник);
		КонецЕсли;
		СтруктураВозврата.Вставить("Должность", Выборка.Должность);
	КонецЕсли;
    Возврат СтруктураВозврата;
КонецФункции 

Функция ПроверкаЗаместителя(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЗаместителиСрезПоследних.Заместитель КАК Заместитель
		|ИЗ
		|	РегистрСведений.ЛБ_Заместители.СрезПоследних(
		|			&Дата,
		|			СотрудникКогоЗамещают = &Сотрудник
		|				И ОкончаниеЗамещения >= &Дата) КАК ЛБ_ЗаместителиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заместитель;
	Иначе
		Возврат Справочники.ЛБ_Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПечатьСоглашениеОбЭДОСервер(Клиент, ИзФормыПечати = Ложь) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиСоглашенияЭДО(Клиент, ИзФормыПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СоглашениеОбЭДО";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_СоглашениеОбЭДО");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьДоговор   = Макет.ПолучитьОбласть("Договор");
	ОбластьСогласия  = Макет.ПолучитьОбласть("Согласия");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьСогласия.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьДоговор);
	ТабличныйДокумент.Вывести(ОбластьСогласия);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(СтруктураДанных.Ломбард) + 
	"; " + Строка(СтруктураДанных.Клиент) + "; " + "Соглашение об ЭДО от " + Строка(СтруктураДанных.ДатаЗаключения);
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	ОбластьШрифт = ТабличныйДокумент.Область("R39C1:R39C5");
	ТабличныйДокумент.НижнийКолонтитул.Шрифт = ОбластьШрифт.Шрифт;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьЗаявлениеИзменениеКонтактныхДанных(Клиент, Период, ИзФормыПечати, СтруктураРеквизитовКонтактныеДанныеДляПечати = Неопределено) Экспорт
	
	СтруктураДанных = ПолучитьДанныеДляПечатиИзменениеКонтактныхДанных(Клиент, Период, ИзФормыПечати, СтруктураРеквизитовКонтактныеДанныеДляПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеКонтактныхДанных";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ИзменениеКонтактныхДанных");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные   = Макет.ПолучитьОбласть("Данные");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Если ЗначениеЗаполнено(СтруктураДанных.Телефон) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.Телефон;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ТелефонДополнительный) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ТелефонДополнительный;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.Email) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.Email;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.КонтактноеЛицо) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.КонтактноеЛицо;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ТелефонКонтактногоЛица) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ТелефонКонтактногоЛица;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураДанных.ФактическийАдрес) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ФактическийАдрес;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ПочтовыйАдрес) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ПочтовыйАдрес;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;

	
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	//ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	//ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	//ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(СтруктураДанных.Ломбард) + 
	//"; " + Строка(СтруктураДанных.Клиент) + "; " + "Соглашение об ЭДО от " + Строка(СтруктураДанных.ДатаЗаключения);
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 8);
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт.Масштаб = 8;
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт.Полужирный = Ложь;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьРасторжениеЭДОСервер(Клиент, ИзФормыПечати = Ложь) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиРасторженияЭДО(Клиент, ИзФормыПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасторжениеЭДО";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_РасторжениеЭДО_Клиент");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

#КонецОбласти
